{
  "sections": [
    {
      "id": "title",
      "titles": {
        "ja": "2025 後期生徒会選挙 杉山 瑳久哉 公約",
        "en": "2025 Fall Student Council Election: Sugiyama Sakuya's Platform",
        "tl": "2025 Fall Student Council Election: Platform ni Sugiyama Sakuya"
      },
      "content": {
        "ja": "<div class='election-header'><h1>2025 後期生徒会選挙 杉山 瑳久哉 公約</h1></div>",
        "en": "<div class='election-header'><h1>2025 Fall Student Council Election: Sugiyama Sakuya's Platform</h1></div>",
        "tl": "<div class='election-header'><h1>2025 Fall Student Council Election: Platform ni Sugiyama Sakuya</h1></div>"
      }
    },
    {
      "id": "introduction",
      "titles": {
        "ja": "はじめに",
        "en": "Introduction",
        "tl": "Panimula"
      },
      "content": {
        "ja": "<h2>私が目指す学校</h2><p>私が目指す学校は、すべての人が、楽しく学ぶことができる学校です。\n</p><p>あなたは、学校で、タブレットが活用されていない、と思ったことはありませんか？\n<br>はっきり言って、使いずらいですよね。\n<br>そこで、私は、Deep-Schoolというアプリを制作しました。\n</p>",
        "en": "<h2>The School I Aim to Create</h2><p>The school I aim to create is one where everyone can learn with joy. Have you ever felt that tablets aren't being used effectively at school? Let's be honest—they're hard to use, right? That's why I created an app called Deep-School.</p>",
        "tl": "<h2>Ang Paaralang Nais Kong Makamit</h2><p>Ang paaralang nais kong makamit ay isang lugar kung saan lahat ay maaaring matuto nang may kasiyahan. Naramdaman mo na ba na hindi epektibong ginagamit ang mga tablet sa paaralan? Maging totoo tayo—mahirap gamitin, di ba? Kaya naman gumawa ako ng isang app na tinatawag na Deep-School.</p>"
      }
    },
    {
      "id": "about",
      "titles": {
        "ja": "Deep-Schoolについて",
        "en": "About Deep-School",
        "tl": "Tungkol sa Deep-School"
      },
      "content": {
        "ja": "<h2>Deep-Schoolとは</h2><p>Deep-Schoolは、あなたの学びを、たくさんの面からサポートするツールです。\n<br>たくさんツールがあるので、一つ一つ簡単に説明していきます。\n</p>",
        "en": "<h2>About Deep-School</h2><p>Deep-School is a tool that supports your learning from many angles. Since there are many tools, I'll briefly explain each one.</p>",
        "tl": "<h2>Tungkol sa Deep-School</h2><p>Ang Deep-School ay isang tool na sumusuporta sa inyong pag-aaral sa maraming paraan. Dahil maraming tools, maikling ipapaliwanag ko ang bawat isa.</p>"
      }
    },
    {
      "id": "design",
      "titles": {
        "ja": "デザイン",
        "en": "Design",
        "tl": "Disenyo"
      },
      "content": {
        "ja": "<h2>Deep-Schoolのデザイン</h2><p>シンプルでかつ直感的なデザインを追求しました。\n\n黒板のようなテーマは、皆さんに親しみやすいものになればいいな、と思い採用しました。\n\nまた、アニメーションも、美しく、楽しく、そして自然なものになるように、設計・採用しました。\n</p>",
        "en": "<h2>Deep-School's Design</h2><p>I pursued a simple yet intuitive design. I chose a blackboard-like theme hoping it would feel familiar and approachable to everyone. I also designed and implemented animations to be beautiful, enjoyable, and natural.</p>",
        "tl": "<h2>Disenyo ng Deep-School</h2><p>Hinabol ko ang simple ngunit intuitive na disenyo. Pumili ako ng blackboard-like theme na umaasa kong magiging pamilyar at madaling lapitan para sa lahat. Dinisenyo at nilagay ko rin ang mga animation na magaganda, nakakatuwa, at natural.</p>"
      }
    },
    {
      "id": "apps",
      "titles": {
        "ja": "アプリ連携",
        "en": "App Integration",
        "tl": "Pagsasama-sama ng mga App"
      },
      "content": {
        "ja": "<h2>アプリ連携</h2><p>Deep-Schoolには、いくつかのアプリが搭載されています。\n\nそして、すべてのアプリを連携させて使うことができます。\n\n最も多くのアプリでその機能を使うことができるのは、ToasterMachineです。\n\nToasterMachineは、AIを使ってあなたをサポートするツールです。\n\nメニューにある「ToasterMachine」は、ToasterMachineとチャットできるものですが、\n\n実は、すべてのアプリで、このToasterMachineを活用することができます。\n\nどのアプリでも、Ctrl+Shift⇧+Tを押すと、ToasterMachineとチャットすることができます。\n\n今のアプリの画面をToasterMachineに送ることもできます。\n\nそして、もちろんあなたのデータは、私たちを含め誰も見ることができません。\n</p>",
        "en": "<h2>App Integration</h2><p>Deep-School comes with several built-in apps. You can use all these apps together in a connected way. The app where you can use this feature most extensively is ToasterMachine. ToasterMachine is a tool that uses AI to support you. The 'ToasterMachine' option in the menu lets you chat with ToasterMachine, but actually, you can utilize this ToasterMachine across all apps. Press Ctrl+Shift⇧+T in any app to chat with ToasterMachine. You can also send the current app screen to ToasterMachine. And of course, no one, including us, can see your data.</p>",
        "tl": "<h2>Pagsasama-sama ng mga App</h2><p>Ang Deep-School ay may kasamang ilang built-in apps. Maaari ninyong gamitin ang lahat ng apps na ito nang magkakakonektang paraan. Ang app kung saan pinakamaaari ninyong gamitin ang feature na ito ay ang ToasterMachine. Ang ToasterMachine ay isang tool na gumagamit ng AI para suportahan kayo. Ang 'ToasterMachine' option sa menu ay nagbibigay-daan sa inyo na makipag-chat sa ToasterMachine, ngunit sa totoo lang, maaari ninyong gamitin ang ToasterMachine sa lahat ng apps. Pindutin ang Ctrl+Shift⇧+T sa anumang app para makipag-chat sa ToasterMachine. Maaari rin ninyong ipadala ang kasalukuyang app screen sa ToasterMachine. At siyempre, walang sinuman, kasama na kami, na makakakita sa inyong data.</p>"
      }
    },
    {
      "id": "scr",
      "titles": {
        "ja": "SCRアプリ",
        "en": "SCR App",
        "tl": "SCR App"
      },
      "content": {
        "ja": "<h2>SCRアプリ</h2><p>このアプリでは、あなたのわからないことを、みんなに質問することができます。\n\nそして、みんなの質問に、誰でも答えることができます。\n\nもし、すぐに答えが知りたい場合は、ToasterMachineに回答してもらうことができます。\n\nToasterMachineと、仲間の力を組み合わせることで、効率的な素晴らしい学習をすることができます。\n</p>",
        "en": "<h2>SCR App</h2><p>This app lets you ask everyone questions about things you don't understand. And anyone can answer everyone's questions. If you need an answer right away, you can get ToasterMachine to respond. By combining ToasterMachine with the power of your peers, you can learn efficiently and effectively, tailored just for you.</p>",
        "tl": "<h2>SCR App</h2><p>Ang app na ito ay nagbibigay-daan sa inyo na magtanong sa lahat tungkol sa mga bagay na hindi ninyo naiintindihan. At kahit sino ay maaaring sumagot sa mga tanong ng lahat. Kung kailangan ninyo ng sagot kaagad, maaari ninyong hilingin sa ToasterMachine na sumagot. Sa pamamagitan ng pagsasama ng ToasterMachine sa kapangyarihan ng inyong mga kapantay, maaari kayong matuto nang mabisa at epektibo, na naaayon sa inyo.</p>"
      }
    },
    {
      "id": "pickramu",
      "titles": {
        "ja": "Pickramu",
        "en": "Pickramu",
        "tl": "Pickramu"
      },
      "content": {
        "ja": "<h2>Pickramu</h2><p>「SCR」では質問ができますが、「Pickramu」では、ワークを使った勉強ができます。\n\n「Pickramu」には、独自作成のワークがたくさんあります。\n\nこのワークを活用することで、いつでもどこでも、学習することができます。\n\nもちろん、わからないことはToasterMachineを使って、いつでもサポートを受けることができます。\n</p>",
        "en": "<h2>Pickramu</h2><p>While 'SCR' lets you ask questions, 'Pickramu' lets you study using worksheets. 'Pickramu' has tons of original worksheets. Using these worksheets, you can learn anytime, anywhere. Of course, you can always get support for anything you don't understand using ToasterMachine.</p>",
        "tl": "<h2>Pickramu</h2><p>Habang ang 'SCR' ay nagbibigay-daan sa inyo na magtanong, ang 'Pickramu' naman ay nagbibigay-daan sa inyo na mag-aral gamit ang mga worksheet. Ang 'Pickramu' ay may maraming orihinal na worksheets. Gamit ang mga worksheet na ito, maaari kayong matuto kahit saan, kahit kailan. Siyempre, maaari kayong humingi ng tulong sa anumang hindi ninyo naiintindihan gamit ang ToasterMachine.</p>"
      }
    },
    {
      "id": "notea",
      "titles": {
        "ja": "Notea",
        "en": "Notea",
        "tl": "Notea"
      },
      "content": {
        "ja": "<h2>Notea</h2><p>学校のワークや、授業メモを作りたい。\n\nそんな時は、「Notea」アプリを使いましょう。\n\nシンプルで、紙のノートっぽさを重視したNoteaは、ページ機能があり、これを活用することで、紙のノートのように、ページ単位での管理ができるようになります。\n\nそして、赤シート機能もあるので、暗記ノートを作るのにもおすすめです。\n\nNoteaでも、ToasterMachineに質問したりすることができます。\n</p>",
        "en": "<h2>Notea</h2><p>Want to create school workbooks or class notes? That's when you should use the 'Notea' app. Notea is simple and emphasizes a paper notebook feel. It has a page function, allowing you to manage your notes page by page, just like a physical notebook. It also has a red sheet function, making it great for creating flashcards. You can also ask questions to ToasterMachine within Notea.</p>",
        "tl": "<h2>Notea</h2><p>Gusto mong gumawa ng school workbooks o class notes? Ito ang tamang panahon para gamitin ang 'Notea' app. Ang Notea ay simple at binibigyang-diin ang pakiramdam ng papel na notebook. Mayroon itong page function, na nagbibigay-daan sa inyo na ayusin ang inyong mga tala pahina sa pahina, tulad ng isang pisikal na notebook. Mayroon din itong red sheet function, na mainam para gumawa ng flashcards. Maaari rin kayong magtanong sa ToasterMachine sa loob ng Notea.</p>"
      }
    },
    {
      "id": "moralfruit",
      "titles": {
        "ja": "MoralFruit",
        "en": "MoralFruit",
        "tl": "MoralFruit"
      },
      "content": {
        "ja": "<h2>MoralFruit</h2><p>これらの基本アプリに加えて、標準搭載の、専門アプリもあります。\n\nMoralFruitは、道徳学習を家でできる画期的なアプリです。\n\nToasterMachineベースのエージェントと、道徳的な、難しい問題を考えることで、p4cのような学習をすることができます。\n\n人と話すのは恥ずかしいあなたでも、道徳という学校でしか学べない教科を、家で学べるようになります。\n</p>",
        "en": "<h2>MoralFruit</h2><p>In addition to these core apps, there are also specialized apps included as standard. MoralFruit is a groundbreaking app that lets you study ethics at home. By engaging with ToasterMachine-based agents and contemplating challenging ethical questions, you can experience learning similar to P4C (Philosophy for Children). Even if talking to people makes you feel shy, you can now study ethics—a subject typically only taught at school—right at home.</p>",
        "tl": "<h2>MoralFruit</h2><p>Bilang karagdagan sa mga pangunahing app na ito, mayroon ding mga espesyalisadong app na kasama bilang pamantayan. Ang MoralFruit ay isang makabagong app na nagbibigay-daan sa iyo na mag-aral ng etika sa bahay. Sa pamamagitan ng pakikipag-ugnayan sa mga ahente na batay sa ToasterMachine at pag-iisip tungkol sa mga mahihirap na tanong sa etika, maaari kang makaranas ng pag-aaral na katulad ng P4C (Philosophy for Children). Kahit na nahihiya kang makipag-usap sa mga tao, maaari ka na ngayong mag-aral ng etika—isang paksa na karaniwan lamang itinuturo sa paaralan—sa mismong bahay mo.</p>"
      }
    },
    {
      "id": "koodi",
      "titles": {
        "ja": "Koodi Studio",
        "en": "Koodi Studio",
        "tl": "Koodi Studio"
      },
      "content": {
        "ja": "<h2>Koodi Studio</h2><p>Koodi Studioでは、プログラミング学習をすることができます。\n\nToasterMachineとの連携を前提に設計されたアプリで、わからないことがあれば、すぐに聞くことができます。\n\nいくつかのレッスンがあり、すべての学習を終えると、ゲームを制作できるほどまでに上達することができます。\n\nテストも充実していて、家で最高レベルのプログラミング学習をすることができます。\n</p>",
        "en": "<h2>Koodi Studio</h2><p>Koodi Studio enables programming learning. Designed to integrate with ToasterMachine, you can ask questions immediately if you get stuck. It offers several lessons, and upon completing all learning, you'll be skilled enough to create games. With comprehensive tests, you can achieve top-level programming learning at home.</p>",
        "tl": "<h2>Koodi Studio</h2><p>Ang Koodi Studio ay nagbibigay-daan sa pag-aaral ng programming. Dinisenyo upang makipag-ugnayan sa ToasterMachine, maaari kang magtanong kaagad kung ikaw ay mahirapan. Nag-aalok ito ng ilang mga aralin, at sa pagtatapos ng lahat ng pag-aaral, magiging bihasa ka nang sapat upang makalikha ng mga laro. Sa komprehensibong mga pagsusulit, maaari mong makamit ang pinakamataas na antas ng pag-aaral ng programming sa bahay.</p>"
      }
    },
    {
      "id": "skrift",
      "titles": {
        "ja": "Skrift",
        "en": "Skrift",
        "tl": "Skrift"
      },
      "content": {
        "ja": "<h2>Skrift</h2><p>Skriftというアプリもあります。\n\nこのアプリは、辞書アプリです。\n\nしかし、検索機能がありません。\n\nこれは、紙の辞書の良さを活かしたアプリで、目的の単語を探していると、いろいろな単語が目に入ってくるので、結果的に語彙力の向上につながります。\n</p>",
        "en": "<h2>Skrift</h2><p>There's also an app called Skrift. This app is a dictionary. However, it lacks a search function. It's an app that leverages the strengths of a paper dictionary. While searching for a specific word, you'll encounter various other words, which ultimately helps improve your vocabulary.</p>",
        "tl": "<h2>Skrift</h2><p>Mayroon ding app na tinatawag na Skrift. Ang app na ito ay isang diksyonaryo. Gayunpaman, wala itong search function. Ito ay isang app na nagpapakinabang sa mga kalakasan ng isang papel na diksyonaryo. Habang naghahanap ng isang partikular na salita, makikita mo ang iba't ibang salita, na sa huli ay makakatulong na mapabuti ang iyong bokabularyo.</p>"
      }
    },
    {
      "id": "cstore",
      "titles": {
        "ja": "CStore",
        "en": "CStore",
        "tl": "CStore"
      },
      "content": {
        "ja": "<h2>CStore</h2><p>もっとたくさんのアプリが欲しい、あなたには、CStoreという便利なシステムがあります。\n\nCStoreでは、専門的なアプリを、簡単に手に入れることができます。\n\nあなたが作ったアプリを公開することもできます。\n\nしかも、すべて無料で利用することができます。\n\nすべてのアプリは、審査を受けてから公開されるので、セキュリティを確保することもできます。\n</p>",
        "en": "<h2>CStore</h2><p>For those wanting more apps, there's a convenient system called CStore. At CStore, you can easily obtain specialized apps. You can also publish apps you've created. What's more, everything is available for free. All apps undergo review before publication, ensuring security.</p>",
        "tl": "<h2>CStore</h2><p>Para sa mga nais ng mas maraming app, mayroong isang maginhawang sistema na tinatawag na CStore. Sa CStore, madali kang makakakuha ng mga espesyalisadong app. Maaari mo ring i-publish ang mga app na iyong ginawa. Higit pa rito, lahat ay magagamit nang libre. Ang lahat ng app ay sumasailalim sa pagsusuri bago i-publish, na nagsisiguro ng seguridad.</p>"
      }
    },
    {
      "id": "security",
      "titles": {
        "ja": "セキュリティ",
        "en": "Security",
        "tl": "Seguridad"
      },
      "content": {
        "ja": "<h2>セキュリティ</h2><p>でも、こんなたくさんの機能があると、セキュリティが心配ですよね。\n\nそこで私たちは、まだ一般的に使われていない、超強力暗号を利用してデータを保存し、画期的なデータ所有システムを実現しました。\n\nまた、ToasterMachineやSCRアプリには、3重ものフィルタシステムを採用し、みんなが安心して使えるDeep-Schoolを目指しました。\n\nNoteaのデータも、KoodiStudioのデータも、教師などの特別な要求がなければ、絶対にあなた以外誰も見ることはできません。\n</p>",
        "en": "<h2>Security</h2><p>But with so many features, security might be a concern, right? That's why we use ultra-strong encryption, not yet widely adopted, to store data, achieving a groundbreaking data ownership system. Furthermore, ToasterMachine and SCR apps employ a triple-layered filter system, aiming to make Deep-School a place everyone can use with peace of mind. Neither Notea's data nor KoodiStudio's data can ever be viewed by anyone other than you, unless specifically requested by teachers or other authorized personnel.</p>",
        "tl": "<h2>Seguridad</h2><p>Ngunit sa napakaraming mga tampok, maaaring maging isang alalahanin ang seguridad, tama ba? Iyon ang dahilan kung bakit gumagamit kami ng ultra-strong encryption, na hindi pa malawakang ginagamit, upang mag-imbak ng data, na nakakamit ang isang makabagong sistema ng pagmamay-ari ng data. Bukod dito, ang ToasterMachine at SCR apps ay gumagamit ng triple-layered filter system, na naglalayong gawing isang lugar ang Deep-School kung saan maaaring gamitin ng lahat nang may kapanatagan ng loob. Ang data ng Notea o KoodiStudio ay hindi maaaring matingnan ng sinuman maliban sa iyo, maliban kung partikular na hiniling ng mga guro o ibang awtorisadong tauhan.</p>"
      }
    },
    {
      "id": "conclusion",
      "titles": {
        "ja": "まとめ",
        "en": "Summary",
        "tl": "Buod"
      },
      "content": {
        "ja": "<h2>まとめ</h2><p>Deep-Schoolは、みんなが安心して使える革命的な学習システムです。\n\nこのシステムが導入されれば、もっと効率的に、楽しく、そして安全に学べる環境が整います。\n\n環境さえ整えば、かなりの余裕が生まれて、今までできなかったことも色々できるようになるでしょう。\n\n学校が楽しく学べる場所になるか、今のままかは、あなたの手によって変えられることです。\n\nあなたが、学校を変えられるのは、今しかないかもしれません。\n\n少しでも学校を、もっと楽しく、もっと安全に、もっと効率的に学べる場所にしたいと思うなら、私、杉山 瑳久哉（すぎやま さくや）に投票お願いします。\n\nぜひ、みんなで、学校での学びに革命を起こしましょう。</p>",
        "en": "<h2>Summary</h2><p>Deep-School is a revolutionary learning system everyone can use with confidence. Implementing this system creates an environment for learning that is more efficient, enjoyable, and secure. With the right environment in place, you'll gain significant flexibility, enabling you to do many things previously impossible. Whether school becomes a place where learning is enjoyable or remains as it is now is something you can change. Now may be the only time you can change school. If you want to make school even a little more enjoyable, safer, and a place where learning is more efficient, please vote for me, Sakuya Sugiyama. Let's all work together to revolutionize learning at school.</p>",
        "tl": "<h2>Buod</h2><p>Ang Deep-School ay isang rebolusyonaryong sistema ng pag-aaral na maaaring gamitin ng lahat nang may kumpiyansa. Ang pagpapatupad ng sistemang ito ay lumilikha ng isang kapaligiran para sa pag-aaral na mas mahusay, kasiya-siya, at ligtas. Sa tamang kapaligiran, makakakuha ka ng makabuluhang kakayahang umangkop, na nagbibigay-daan sa iyo na gawin ang maraming bagay na dati ay imposible. Kung ang paaralan ay magiging isang lugar kung saan kasiya-siya ang pag-aaral o mananatili ito kung ano ito ngayon ay isang bagay na maaari mong baguhin. Ngayon ay maaaring ang tanging oras na maaari mong baguhin ang paaralan. Kung nais mong gawing mas kasiya-siya, mas ligtas, at isang lugar kung saan mas mahusay ang pag-aaral ang paaralan, mangyaring iboto ninyo ako, si Sakuya Sugiyama. Magtulungan tayong lahat upang baguhin ang paraan ng pag-aaral sa paaralan.</p>"
      }
    }
  ]
}
